{"slug":"314","title":314,"date":"2022-03-14T00:00:00.000Z","excerpt":"It's Pi Day.","tags":["math","random"],"html":"<p>It’s Pi Day. You’d think I’d care since I love math, but I don’t really. I even like pie too.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read","relatedPosts":[{"slug":"battery","title":"Battery","date":"2022-06-19T00:00:00.000Z","excerpt":"I updated my drone batteries.","tags":["photography","random"],"html":"<h1 id=\"drone-update\">Drone Update<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#drone-update\"><span class=\"heading-link\">#</span></a></h1>\n<p>In my <a href=\"/winter-drone\">Winter Drone</a> post from the beginning of the year, I mentioned that I was having trouble updating my drone batteries’ firmware. I booted up the drone today, and was able to update the app and firmware straightforwardly. Another problem that solved itself through procrastination.</p>\n<p>It’s strange how sometimes procrastination pays off.</p>\n<p>I also learned that the batteries are designed to drain to storage capacity (30% or something) after 10 days. That means I should only charge them immediately before flying.</p>\n<h1 id=\"videos\">Videos<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#videos\"><span class=\"heading-link\">#</span></a></h1>\n<p>I still haven’t made any videos. I was working on making <a href=\"https://domination.ihtfy.com/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">a site</a> to play the Eight Queens Puzzle and the equivalents for the other pieces. You can also play the companion problem; the original is to place the maximum number of non-attacking pieces, but you can also try to place the minimum number of pieces to occupy or attack all squares.</p>\n<p>There are still some features I could implement:</p>\n<ul><li>Highlight covered squares on hover</li>\n<li>Highlight uncovered squares in Domination mode</li>\n<li>Highlight attacking pieces in Non-Attacking mode</li>\n<li>Save scores in local storage</li>\n<li>Show the differential between current, personal best, and best possible</li>\n<li>Generate all possible solutions (I’ve done this for some but not all)</li></ul>\n<p>I’d like to prioritize making the video, though.</p>\n<h1 id=\"ads\">Ads<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#ads\"><span class=\"heading-link\">#</span></a></h1>\n<p>I added Google AdSense ads to most of my project sites. I opted to only use “anchor” ads - the kind that slide in from the top or bottom and and be collapsed. I find these to be the least invasive kind, since they’re dismissable. I will probably remove these at some point, because I don’t think they will ever generate substantial revenue.</p>\n<p>I haven’t promoted any of my sites other than posting on this blog and word of mouth. I suppose a YouTube video could lead some people there. I’ll leave them for now and see.</p>\n<p>The ads are designed for multi-page sites and not apps or single page sites. I’ll only get 1 impression per visit, even if the person clicks and navigates all over the app for hours. Also, the ads on <a href=\"https://empire.ihtfy.com/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Empire</a> almost never get fulfilled. I think it has to do with the css or something - maybe the navbar or sidebar. I tried commenting out components, but I couldn’t get it working reliably.</p>\n<h1 id=\"hosts\">Hosts<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#hosts\"><span class=\"heading-link\">#</span></a></h1>\n<p>To test out Google Ads when running a local dev server, I edit my hosts file. On Windows, it’s at <code>C:\\Windows\\System32\\drivers\\etc\\hosts</code>. I add <code>127.0.0.1 empire.ihtfy.com</code> to the bottom. And then when I start the server, I just go to <code>empire.ihtfy.com</code>. I can’t remember if I have to add the port - I think I do, but only in the address bar in the browser - the host file is definitely just the base url and ip address.</p>","css":{"code":"","map":null},"head":"","readingTime":"3 min read"},{"slug":"mathjax","title":"MathJax","date":"2022-05-24T00:00:00.000Z","excerpt":"You can write math in GitHub ReadMes now.","tags":["math","code"],"html":"<h1 id=\"math-on-github\">Math on GitHub<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#math-on-github\"><span class=\"heading-link\">#</span></a></h1>\n<p>I was looking at my <a href=\"https://github.com/IHTFY/mandelbrot\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">mandelbrot project</a>, and I was wondering if I could better format the math. After googling around, I found a few hacks: open APIs to generate SVG or PNG math images, a hack to use Jupyter notebook on github, and some other stuff.</p>\n<p>Looking through some old GitHub supoprt tickets, they kept saying it’s not supported. But just 5 days ago, <a href=\"https://github.blog/2022-05-19-math-support-in-markdown/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">they finally added it</a>.</p>\n<p>It’s nice that they added that.</p>\n<h1 id=\"where-were-you\">Where were you?<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#where-were-you\"><span class=\"heading-link\">#</span></a></h1>\n<p>Also, I realize I’ve totally failed on my daily posts, as well as weekly posts, and weekly videos. I’ve been going to the gym regularly at least.</p>\n<p>I was able to get ihtfy.com approved for google adsense, so I may add ads to some of my projects at some point.</p>\n<p>I do still plan on making YouTube videos.</p>\n<p>I’m realizing as I write this post, it’s not quite as simple to create a posts as the WordPress setup. Writing in markdown is fine, but manually creating the appropriate file structure, asset folder, optimized images, is a bit of a pain. But I do like that I can customize everything and even include scripts and other packages if I want.</p>","css":{"code":"","map":null},"head":"","readingTime":"2 min read"},{"slug":"again","title":"Again","date":"2022-03-30T00:00:00.000Z","excerpt":"I forgot to write again","tags":["random"],"html":"<p>I forgot to write again.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"}]}