{"slug":"chess-engine","title":"Chess Engine","date":"2022-01-15T00:00:00.000Z","excerpt":"Making a chess engine","tags":["code"],"html":"<p>I started making a chess engine a while ago. I only got as far as making random moves.</p>\n<p>Today, I added a basic evaluation function that simply counts the material imbalance. Then it uses mini-max with alpha beta pruning at a depth of 3. It’s still very dumb, and you can win fast with a short tactic.</p>\n<p>I know many chess engines use different evaluation formulas for he midgame and endgame, such as giving greater preference to long range pieces (bishops and rooks). I don’t plan on outperforming stockfish, but I’d like to make an engine that I can’t beat. My online rating is around 1800.</p>\n<p>I learned chess from my dad when I was around 7 years old. He always beat me, and I was never very good, but I always enjoyed the game. My best friend Taylor and I wound play. We nearly alternated wins each game.</p>\n<p>I picked the game up again in the summer of 2020. My blitz rating started at 1400 and dropped to 650. It was a steady climb to 1650 over the course of 9 months. The next 3-6 months, I climbed to around 1750. I mostly do puzzles now since I find them relaxing. I also watch videos - mostly Daniel Naroditsky.</p>\n<p>My reintroduction came after watching the Penguinz0/xQc 6 move checkmate. I watched the remainder of pogchamps, then found Danya’s channel. I definitely recommend it to anyone interested in how to become a better chess player.</p>\n<p>I realized there were so many heuristics I had never considered. I had always worked on pure calculation when I was younger. But it makes sense to slowly expand your pieces, keeping everything defended along the way.</p>\n<p>I had never even thought about playing positionally. I never put rooks on open files without the intention of traveling down the file on the next move. Similarly, I never thought to place my bishops on long diagonals where they may one day have reign across the whole board.</p>","css":{"code":"","map":null},"head":"","readingTime":"2 min read","relatedPosts":[{"slug":"domination","title":"Domination","date":"2022-07-23T00:00:00.000Z","excerpt":"I made another chess puzzle game thing.","tags":["code","gaming"],"html":"<h2 id=\"play-it\"><a href=\"https://domination.ihtfy.com/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Play It!</a><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#play-it\"><span class=\"heading-link\">#</span></a></h2>\n<p><a href=\"https://domination.ihtfy.com/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">domination.ihtfy.com</a></p>\n<h2 id=\"intro\">Intro<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#intro\"><span class=\"heading-link\">#</span></a></h2>\n<p>There’s a classic chess puzzle called the <a href=\"https://mathworld.wolfram.com/QueensProblem.html\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Eight Queens Problem</a>. The goal is to place eight queens on a chessboard such that no two queens are attacking each other. It’s pretty tricky. Eight also happens to be the maximum number. It’s clear we cannot place nine, because each queen must occupy a private column and row.</p>\n<p>This puzzle can be generalized to any of the other pieces. Pawns are a bit funny, because they are the only piece whose movement depends on the board orientation.</p>\n<h2 id=\"game-modes\">Game Modes<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#game-modes\"><span class=\"heading-link\">#</span></a></h2>\n<p>I call this “Non-Attacking” mode, and the goal is to place as many of a given piece type without any pieces attacking each other. There is another mode called “Domination”.</p>\n<p>The goal of domination is to attack or occupy every square on the board with the fewest number of pieces - using only one type of piece.</p>\n<h2 id=\"solutions\">Solutions<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#solutions\"><span class=\"heading-link\">#</span></a></h2>\n<p>The blue buttons will generate solutions for either game mode and any piece. The solution set is <strong>not</strong> complete for every combination at the time of writing.</p>\n<h2 id=\"highlighting\">Highlighting<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#highlighting\"><span class=\"heading-link\">#</span></a></h2>\n<ul><li>If there are mixed pieces on the board, the position is not a valid solution, so some of the pieces will be highlighted.</li>\n<li>In Non-Attacking mode, pieces that attack each other will be highlighted</li>\n<li>In Domination mode, any squares that are not covered by a piece will be highlighted</li></ul>\n<h2 id=\"saving\">Saving<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#saving\"><span class=\"heading-link\">#</span></a></h2>\n<p>The scoreboard and sound/highlighting/game mode settings are stored in the browser’s <code>localStorage</code>. This means it will persist if you leave the site and come back later. You can click the <code>RESET SCORES</code> button to clear this at any time.</p>\n<h2 id=\"pwa\">PWA<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#pwa\"><span class=\"heading-link\">#</span></a></h2>\n<p>It is also an installable PWA with offline support, so you can add it to your phone or computer as an app.</p>","css":{"code":"","map":null},"head":"","readingTime":"2 min read"},{"slug":"mathjax","title":"MathJax","date":"2022-05-24T00:00:00.000Z","excerpt":"You can write math in GitHub ReadMes now.","tags":["math","code"],"html":"<h1 id=\"math-on-github\">Math on GitHub<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#math-on-github\"><span class=\"heading-link\">#</span></a></h1>\n<p>I was looking at my <a href=\"https://github.com/IHTFY/mandelbrot\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">mandelbrot project</a>, and I was wondering if I could better format the math. After googling around, I found a few hacks: open APIs to generate SVG or PNG math images, a hack to use Jupyter notebook on github, and some other stuff.</p>\n<p>Looking through some old GitHub supoprt tickets, they kept saying it’s not supported. But just 5 days ago, <a href=\"https://github.blog/2022-05-19-math-support-in-markdown/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">they finally added it</a>.</p>\n<p>It’s nice that they added that.</p>\n<h1 id=\"where-were-you\">Where were you?<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#where-were-you\"><span class=\"heading-link\">#</span></a></h1>\n<p>Also, I realize I’ve totally failed on my daily posts, as well as weekly posts, and weekly videos. I’ve been going to the gym regularly at least.</p>\n<p>I was able to get ihtfy.com approved for google adsense, so I may add ads to some of my projects at some point.</p>\n<p>I do still plan on making YouTube videos.</p>\n<p>I’m realizing as I write this post, it’s not quite as simple to create a posts as the WordPress setup. Writing in markdown is fine, but manually creating the appropriate file structure, asset folder, optimized images, is a bit of a pain. But I do like that I can customize everything and even include scripts and other packages if I want.</p>","css":{"code":"","map":null},"head":"","readingTime":"2 min read"},{"slug":"choppy","title":"Choppy","date":"2022-03-28T00:00:00.000Z","excerpt":"I made an unlisted stream about the IQ test generator.","tags":["code"],"html":"<p>I did an <a href=\"https://www.youtube.com/watch?v=QikZC9J3ZkQ\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">unlisted stream</a> talking about Raven’s Progressive Matrices. YouTube was telling me it wasn’t getting enough data for a smooth stream, but the replay doesn’t look too bad.</p>\n<p>I’ll probably keep this unlisted for now. I’ll probably make a public video once there’s a working prototype or finished project.</p>\n<p>My laptop fan was running full blast the whole time. I think I had to disable hardware acceleration to get display capture to work on OBS.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"}]}