{"slug":"chess-engine","title":"chess engine","date":"2022-01-16T00:00:00.000Z","excerpt":"TODO","tags":["todo"],"html":"<p>I started making a chess engine a while ago. I only got as far as making random moves.</p>\n<p>Today, I added a basic evaluation function that simply counts the material imbalance. Then it uses mini-max with alpha beta pruning at a depth of 3. It’s still very dumb, and you can win fast with a short tactic.</p>\n<p>I know many chess engines use different evaluation formulas for he midgame and endgame, such as giving greater preference to long range pieces (bishops and rooks). I don’t plan on outperforming stockfish, but I’d like to make an engine that I can’t beat. My online rating is around 1800.</p>\n<p>I learned chess from my dad when I was around 7 years old. He always beat me, and I was never very good, but I always enjoyed the game. My best friend Taylor and I wound play. We nearly alternated wins each game.</p>\n<p>I picked the game up again in the summer of 2020. My blitz rating started at 1400 and dropped to 650. It was a steady climb to 1650 over the course of 9 months. The next 3-6 months, I climbed to around 1750. I mostly do puzzles now since I find them relaxing. I also watch videos - mostly Daniel Naroditsky.</p>\n<p>My reintroduction came after watching the Penguinz0/xQc 6 move checkmate. I watched the remainder of pogchamps, then found Danya’s channel. I definitely recommend it to anyone interested in how to become a better chess player.</p>\n<p>I realized there were so many heuristics I had never considered. I had always worked on pure calculation when I was younger. But it makes sense to slowly expand your pieces, keeping everything defended along the way.</p>\n<p>I had never even thought about playing positionally. I never put rooks on open files without the intention of traveling down the file on the next move. Similarly, I never thought to place my bishops on long diagonals where they may one day have reign across the whole board.</p>","css":{"code":"","map":null},"head":"","readingTime":"2 min read","relatedPosts":[{"slug":"habit","title":"habit","date":"2022-04-02","excerpt":"TODO","tags":["todo"],"html":"<p>I still get reminders from the WordPress app to post everyday. Some days it doesn’t work though.</p>\n<p>I started working on building my website with sveltekit again. It’s at <a href=\"https://site.ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">site.ihtfy.com</a> for now, but eventually I’ll put it on <a href=\"https://ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">ihtfy.com</a> and <a href=\"https://frankiemercado.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">frankiemercado.com</a> will forward to <a href=\"https://ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">ihtfy.com</a> I think.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"again","title":"again","date":"2022-03-31","excerpt":"TODO","tags":["todo"],"html":"<p>I forgot to write again.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"wombo","title":"wombo","date":"2022-03-31","excerpt":"TODO","tags":["todo"],"html":"<p>I’ve been using <a href=\"https://app.wombo.art/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">this site</a> to make the thumbnail images for these posts - using the title as the prompt.</p>\n<p>The last two days, I forgot to write until just after midnight. I adjusted the post date to be 11:59pm just to keep the dates consistent, but I failed to adhere to the original goal. I think I will move to the weekly posts, and just update the draft throughout the week. This should mean there are no more totally junk posts like the last two days.</p>\n<p>Once I migrate to my new site - by June 21, 2022 - I may consolidate these last 3 months of daily posts.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"}]}