{"slug":"happy-new-year","title":"Happy New Year","date":"2022-01-02T00:00:00.000Z","excerpt":"Starting daily posts","tags":["website"],"html":"<p>I have 30 minutes to write this. I wanted to post something on January 1st and hopefully every day this year. Perhaps I’ll count YouTube videos as part of the streak, but I could probably make a post here as well on those days.</p>\n<p>I wish I had a more solid plan for what I want to accomplish; maybe I’ll do that tomorrow, or maybe I’ll do it now.</p>\n<p>I’d like to post frequent youtube videos - weekly would be nice. I’d like to have some of them be a series, like an educational course. I’d like to create a schedule to which I can adhere. I’d like to document the creation process of video/code/music/etc projects. I’d like to organize and display some of the work I’ve already done. I’d like to make money from this endeavor - any amount that scales with reach.</p>\n<p>Those are some ideas I came up with just now. My little sister, Ana, gave me a planner for Christmas last year that I didn’t fully utilize. I’ll try using that to keep me on track, too.</p>\n<p>My brother wants to fly my drone tomorrow, so maybe we’ll do that and I’ll have some things to share.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read","relatedPosts":[{"slug":"scss","title":"SCSS","date":"2022-04-04T00:00:00.000Z","excerpt":"I've been changing the color palette for the new site.","tags":["website"],"html":"<p>I’ve been changing the color palette of the themes. Kind of made a mess, but got it sorted out. I wasn’t very familiar with how sass uses rgb variables and the <code>rgb()</code> and <code>rgba()</code> functions. There doesn’t seem to be a clean way to modify the alpha of a variable color.</p>\n<p>Some docs said you can just use the rgb color as the 1st argument and the alpha as the second in a <code>rgba()</code> but that doesn’t work, unless you simply have the 3 values as the variable, not the actual color. But then you need to convert those numbers anywhere else you need to use the color. So you either need multiple variables, or you’re using <code>rgb()</code> and <code>rgba()</code> at every instance.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"manual","title":"Manual","date":"2022-04-03T00:00:00.000Z","excerpt":"Still converting","tags":["website"],"html":"<p>I’ve been converting my old posts to work with the new site. Slow going, but making progress.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"catchup","title":"Catchup","date":"2022-04-02T00:00:00.000Z","excerpt":"I was working on formatting all my posts again to work with the new site.","tags":["website"],"html":"<p>I was working on formatting all my posts again to work with the new site. It’s taking a while.</p>\n<p>The error messages aren’t very specific; I just know it’s failing when processing all my posts.</p>\n<p>I keep finding changes I need to make, but not all of them yet.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"}]}