{"slug":"hibachi","title":"Hibachi","date":"2022-01-04T00:00:00.000Z","excerpt":"Went out to a hibachi place","tags":["food"],"html":"<p>I forgot I was trying to post something everyday. We went to a Japanese steakhouse today.</p>\n<p><a href=\"https://www.youtube.com/watch?v=xR-Qv-3Lg-g\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"><img src=\"https://i3.ytimg.com/vi/xR-Qv-3Lg-g/maxresdefault.jpg\" alt=\"cat\"></a></p>\n<p>Tomorrow I’m flying back to the San Francisco Bay area, so you’ll probably get another aerial shot.</p>\n<p>My dad makes calendars each year as Christmas presents for our extended family. He includes everyone’s birthdays and anniversaries. There hasn’t been a new version of the calender creator software in a while, and I thought I might be able to create someing that works better. I’ll add that to my list of coding projects to do.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read","relatedPosts":[{"slug":"tikka","title":"Tikka","date":"2022-03-07T00:00:00.000Z","excerpt":"I tried the meatballs and tikka masala.","tags":["food"],"html":"<p>I tried the meatballs and tikka masala. It was pretty good. A quick meal. I just microwaved the meatballs for a couple minutes to thaw, then I added some sauce and microwaved another couple of minutes.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"regional","title":"Regional","date":"2022-03-04T00:00:00.000Z","excerpt":"Have you heard of cheese dip?","tags":["food","random"],"html":"<p>I made cheese dip tonight. No meat again.</p>\n<p>I’m not sure if it’s a family recipe or regional. It’s creamcheese, a little milk, worcestershire sauce, Lawry’s seasoned salt, and diced vidalia onions. It’s best with plain potato chips, but good with Ritz, pretzels, and any other chips.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"meatballs","title":"Meatballs","date":"2022-03-02T00:00:00.000Z","excerpt":"Thought of making meatball masala","tags":["food","random","experiment"],"html":"<p>I just had an idea for dinner tonight.</p>\n<p>We have a giant bag of meatballs from Costco. I often have them as a snack - mixed with some homemade barbecue sauce. I also have a jar of tikka masala. I think that might make a good sauce. Oh, I just remembered it’s Ash Wednesday, so I can’t eat meatballs. Maybe tomorrow.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"}]}