{"slug":"lingo","title":"lingo","date":"2022-02-02","excerpt":"TODO","tags":["todo"],"html":"<p>I played <a href=\"https://www.powerlanguage.co.uk/wordle/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Wordle</a> a while ago, and it reminded me of <a href=\"https://en.wikipedia.org/wiki/Mastermind_(board_game)\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Mastermind</a>. I knew there was another game that was more similar, and I just remembered the gameshow <a href=\"https://en.wikipedia.org/wiki/Lingo_(American_game_show)\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Lingo</a>.</p>\n<p>Wordle is a daily word game, but it could very easily be a normal game that you can play repeatedly. I guess the daily aspect makes people burnout slower, and it promotes sharing with friends since everyone sees the same word - like a daily puzzle on lichess or chess.com. Also, what else can you do while waiting for another word?</p>\n<p>It would be simple to expand the game to use words of different lengths, or have categories of words, or allow unlimited guesses and accumulate an aggregated score for X number of rounds.</p>\n<p>I might make my own version of the game with extra options for fun.</p>\n<p>The “share” text is also unique. It uses emojis to represent how well you did: black boxes for wrong letters, yellow for wrong position, and green for correct placement. This let’s people share their game in a cryptic way, which makes people search for “Wordle” to figure out what ot means.</p>\n<p>I know it started to go viral on tiktok a few weeks ago. Largely, people were sharing strategies, and some people were looking at the code of the game to find the list of target and guess words.</p>","css":{"code":"","map":null},"head":"","readingTime":"2 min read","relatedPosts":[{"slug":"habit","title":"habit","date":"2022-04-02","excerpt":"TODO","tags":["todo"],"html":"<p>I still get reminders from the WordPress app to post everyday. Some days it doesn’t work though.</p>\n<p>I started working on building my website with sveltekit again. It’s at <a href=\"https://site.ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">site.ihtfy.com</a> for now, but eventually I’ll put it on <a href=\"https://ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">ihtfy.com</a> and <a href=\"https://frankiemercado.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">frankiemercado.com</a> will forward to <a href=\"https://ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">ihtfy.com</a> I think.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"again","title":"again","date":"2022-03-31","excerpt":"TODO","tags":["todo"],"html":"<p>I forgot to write again.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"wombo","title":"wombo","date":"2022-03-31","excerpt":"TODO","tags":["todo"],"html":"<p>I’ve been using <a href=\"https://app.wombo.art/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">this site</a> to make the thumbnail images for these posts - using the title as the prompt.</p>\n<p>The last two days, I forgot to write until just after midnight. I adjusted the post date to be 11:59pm just to keep the dates consistent, but I failed to adhere to the original goal. I think I will move to the weekly posts, and just update the draft throughout the week. This should mean there are no more totally junk posts like the last two days.</p>\n<p>Once I migrate to my new site - by June 21, 2022 - I may consolidate these last 3 months of daily posts.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"}]}