{"slug":"matrices","title":"matrices","date":"2022-03-21","excerpt":"TODO","tags":["todo"],"html":"<p>There’s a type of puzzle called a Raven’s Matrix. It was developed as a type of IQ test, but I remember doing it in elementary school. There’s a free IQ test from Mensa Norway you can try: <a href=\"https://test.mensa.no/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">https://test.mensa.no/</a></p>\n<p>I thought it would be fun to make a web app that generates these matrices. There’s a very basic version I found <a href=\"https://www.caseyrule.com/projects/pattern-puzzle\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">here</a>. Basically just a few shapes, different fill colors, and border styles, and sometimes a nested shape.</p>\n<p><a href=\"https://link.springer.com/content/pdf/10.3758/BRM.42.2.525.pdf\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">This</a> is a paper from Sandia National Labs in 2009 which describes some of the patterns used to create the matrices. The implementation is public <a href=\"https://github.com/LauraMatzen/Matrices\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">here</a>, but it uses an old version of Java and I didn’t feel like getting that to run. It also includes sample output from the program, and you can see it’s not as visually diverse as the Norway test.</p>\n<p>I find these types of puzzles pretty simple once you notice the handful of rules used to create them. Some of the most common things are rotating an element, combining rows/columns, overlaying and applying XOR (exclusive OR, meaning it can’t be both), AND, or some other boolean operation, as well as recognizing when theses rules are combined with each and very often row-shifted.</p>\n<table><thead><tr><th>Straight Down</th>\n<th>Down and Right</th></tr></thead>\n<tbody><tr><td>123</td>\n<td>123</td></tr>\n<tr><td>123</td>\n<td>312</td></tr>\n<tr><td>123</td>\n<td>231</td></tr></tbody></table>\n<p>This shifting can happen vertically or in the opposite direction as well. Notice how the numbers form diagonals rather than columns.</p>\n<p>Another common operation is to simply interpret sub elements in a cell as numbers and then add or subtract them to calculate the cell in the final row/column.</p>\n<p>It would be cool to gather people’s raw scores and then calculate the mean and deviation to be able to normalize it and give an IQ score. I could also give explanations for each puzzle at the end since they’re created with simple rules.</p>\n<table><thead><tr><th>flip horizontally⟶</th>\n<th>rotate 180° ⟶</th>\n<th></th></tr></thead>\n<tbody><tr><td>b</td>\n<td>d</td>\n<td>p</td></tr>\n<tr><td>u</td>\n<td>u</td>\n<td>n</td></tr>\n<tr><td>5</td>\n<td>S</td>\n<td></td></tr></tbody></table>\n<p>For example, this puzzle take the first column, then flips horizontally to get the second column, then rotates 180° to get the final column. So the solution takes “5” flips horizontally to become “S”, then rotates 180° to get “S” again.</p>","css":{"code":"","map":null},"head":"","readingTime":"2 min read","relatedPosts":[{"slug":"habit","title":"habit","date":"2022-04-02","excerpt":"TODO","tags":["todo"],"html":"<p>I still get reminders from the WordPress app to post everyday. Some days it doesn’t work though.</p>\n<p>I started working on building my website with sveltekit again. It’s at <a href=\"https://site.ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">site.ihtfy.com</a> for now, but eventually I’ll put it on <a href=\"https://ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">ihtfy.com</a> and <a href=\"https://frankiemercado.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">frankiemercado.com</a> will forward to <a href=\"https://ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">ihtfy.com</a> I think.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"again","title":"again","date":"2022-03-31","excerpt":"TODO","tags":["todo"],"html":"<p>I forgot to write again.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"wombo","title":"wombo","date":"2022-03-31","excerpt":"TODO","tags":["todo"],"html":"<p>I’ve been using <a href=\"https://app.wombo.art/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">this site</a> to make the thumbnail images for these posts - using the title as the prompt.</p>\n<p>The last two days, I forgot to write until just after midnight. I adjusted the post date to be 11:59pm just to keep the dates consistent, but I failed to adhere to the original goal. I think I will move to the weekly posts, and just update the draft throughout the week. This should mean there are no more totally junk posts like the last two days.</p>\n<p>Once I migrate to my new site - by June 21, 2022 - I may consolidate these last 3 months of daily posts.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"}]}