{"slug":"reredo","title":"reredo","date":"2022-02-16T00:00:00.000Z","excerpt":"Redoing the calendar maker again","tags":["code","design"],"html":"<p>I noticed a little bit ago that the calendar maker site doesn’t really need routing. And it’s just a static page hosted on GitHub, so I don’t really need SvelteKit for server side rendering. I had also had some problems getting any component libraries to install. I think I’m going to start over again just using Svelte, and hopefully I can get this library called <a href=\"https://illright.github.io/attractions/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Attractions</a> to work.</p>\n<p>It has a nice <a href=\"https://illright.github.io/attractions/docs/components/file-dropzone\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">FileDropzone</a> component and <a href=\"https://illright.github.io/attractions/docs/components/date-picker\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">DatePicker</a>. I’ll probably just have the settings and data page be <a href=\"https://illright.github.io/attractions/docs/components/tabs\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Tabs</a> or maybe <a href=\"https://illright.github.io/attractions/docs/components/modal\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Modals</a>.</p>\n<p>I think I’ll still use <a href=\"https://dexie.org/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Dexie</a>/<a href=\"https://developer.mozilla.org/en-US/docs/Web/API/IndexedDB_API\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">indexedDB</a> for storage.</p>\n<p>I’ve used <a href=\"http://materializecss.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">MaterializeCSS</a> several times, and it’s a fast way to style a page built without any framework. It also has a <a href=\"https://materializecss.com/pickers.html\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Date Picker</a> component. The library has never been updated though, and there are a few bugs I’ve found while working with it. For example, long months have the last letters cut off; this is probably fixable with some simple CSS, but there’s little stuff like that all over, e.g. missing margins/padding in the header component.</p>\n<p>I’ve used <a href=\"https://bulma.io/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Bulma</a> just once I think - on the <a href=\"https://frankiemercado.com/2021/03/15/knight/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Knight Puzzle</a>. I think it worked pretty well. I had trouble styling the table, because it requires <a href=\"https://sass-lang.com/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">SASS</a> to modify the default styles, and I was trying to keep things simply by just using the Bulma CDN. But Bulma seems to have a collection of extensions (I think made by random users) including a <a href=\"https://wikiki.github.io/components/calendar/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">calender</a>. Bulma has a default <a href=\"https://bulma.io/documentation/form/file/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">File Upload</a> component, but it doesn’t support drag and drop which is nice to have.</p>\n<p>I think Attractions looks sleek, and I think it has most of what I need.</p>","css":{"code":"","map":null},"head":"","readingTime":"2 min read","relatedPosts":[{"slug":"another","title":"another","date":"2022-02-24T00:00:00.000Z","excerpt":"Redesigning my website","tags":["code","website","design"],"html":"<p>I’m still stuck on the MDSveX/prismjs error. I found <a href=\"https://github.com/elianiva/elianiva.my.id\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">another site</a> that uses sveltekit. It’s hosted on vercel, but I wonder if it will work if I just change the adapter to static in <code>svelte.convig.js</code>.</p>\n<p>That worked. I think I’ll use this as a starting point for now.</p>\n<p>Just kidding. Same kind of problem, but showing different errors. When I open a blog it gives an error. But if I refresh, I can navigate back and forth and see all posts without problem.</p>\n<p>So, if I refresh I can’t go to a post the first time. Actually, now it’s not working at all. And now it’s working completely. I don’t know what’s happening - maybe browser caching something? Seems to work now, so I’ll move forward.</p>\n<p>I’m going to see if I can host this page on GitHub with a custom url. I’ve had problems with routing before, so I think it’s worth testing early. I’ll install <code>gh-pages</code> to my developer dependencies using:</p>\n<p><code>npm install gh-pages --save-dev</code></p>\n<p>And I’ll add a script to <code>package.json</code> called <code>deploy</code> that runs:</p>\n<p><code>gh-pages -d build</code></p>\n<p>Now, let’s see if it will host on the default GitHub url. I think I need to check in the whole repository first, because I don’t think gh-pages will create a new one.</p>\n<p>It’s mostly working now, but it’s looking for assets in BASEURL/… vs BASEURL/REPONAME?…, but I think that means it will work if I just use ihtfy.com or even a subdomain like blog.ihtfy.com.</p>\n<p>It’s not working, but I forgot to add a <code>.nojekyll</code> file to the root. I’ll add it in the <code>/static</code> directory and rebuild. Apparently, Jekyll doesn’t post files or directories that start with an underscore.</p>\n<p>GitHub or gh-pages keeps deleting my <code>.nojekyll</code> file. I tried adding some test inside, but that didn’t help. I have to manually add the file back in through GitHub.</p>\n<p>If I open the site in a private window, it doesn’t load the css. If I then hard refresh, it works. But if I do a normal refresh it doesn’t. Ah, just saw that I had another browser window open so the private session never ended. The refresh stuff is gone now.</p>\n<p>I just tried the old starter project again and noticed the build preview is working, but not the dev. Who knows…</p>\n<h2 id=\"comparison\">Comparison<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#comparison\"><span class=\"heading-link\">#</span></a></h2>\n<p>There are some things I like from the different sites.</p>\n<p>From Matt’s:</p>\n<ul><li>SVG animations - Background and logo</li>\n<li>Hover animation on posts (but they’re not on the other cards)</li>\n<li>Smooth scrolling</li>\n<li>Code can show filename and language</li>\n<li>Custom highlighting (sparkle wrapper and brush stroke)</li>\n<li>Featured image for posts</li>\n<li>Different shaped tiling</li>\n<li><a href=\"https://fantinel.dev/web-images-modern-formats/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Image optimization</a></li></ul>\n<p>From Elianiva’s:</p>\n<ul><li>Link/page hover animation</li>\n<li>Dark mode switch (Matt’s is automatic, but I like the option)</li>\n<li>Fading transition between pages (doesn’t work as well on mobile - flashes)</li>\n<li>Scrollbar styling</li>\n<li>Scroll to top button</li>\n<li>Color scheme, but needs more contrast on homepage post elements</li>\n<li>Search in posts with live updating</li>\n<li>Semi-sticky header with animations and mobile reactivity (Matt’s mobile nav loses the links)</li>\n<li>Info bubbles can have header info: date and title</li></ul>\n<p>Matt’s site gives errors on dev, but build works. I’m not sure if I can work with that though. I think I may start with the Elianiva site and add component styling ideas from Matt.</p>\n<ul><li>SVG animations I’ll make on my own</li>\n<li>Hover animations on posts shouldn’t be too hard</li>\n<li>Smooth scrolling I think is just a CSS attribute on html, then maybe some logic to setting scroll points when navigating to different pages, i.e. backwards</li>\n<li>I think I can add filename and language info pretty easily, but maybe it depends on the highlighter or markdown preprocessor, but both use MDSveX.</li>\n<li>I’ll make my own highlighting classes</li>\n<li>I don’t think adding images to posts will be difficult, but making them look nice might be</li>\n<li>I’ll have to see if the tile shapes are automatic and if they depend on the post contents</li></ul>\n<p>The search on Elianiva’s I would guess is just a library but seems a bit daunting. The sticky header might be a little tricky but not sure. Scroll to top isn’t bad, and I think the fading is an option provided by Svelte, but not sure. Huh, they both have smooth-scrolling; maybe I just noticed it on Matt’s because it scrolls to points on the page.</p>\n<p>If GitHub stops auto deleting my <code>.nojekyll</code> that would be nice. I just deployed again, and it seems to be sticking now.</p>","css":{"code":"","map":null},"head":"","readingTime":"4 min read"},{"slug":"plan","title":"plan","date":"2022-02-24T00:00:00.000Z","excerpt":"Working on my new site","tags":["code","design"],"html":"<p>I’ll try starting with Elianiva’s site, since the dev server works as far as I can tell. The changes I want to make are:</p>\n<p>From Matt:</p>\n<ul><li>Have featured images in posts (display when on All Posts /posts)</li>\n<li>Have different sized post tiles, but all small on mobile</li>\n<li>Add hover animation (enlarging) to post tiles</li>\n<li>Add options to display filename and language on code</li>\n<li>Tweak colors for more contrast</li>\n<li>Add SVG animations</li>\n<li>Maybe use scrollTo/scrollIntoView during page navigation</li>\n<li>Maybe use image optimization</li></ul>\n<p>I’ll also need to format my exported WordPress data to match. I noticed both site store the images in the static folder, then reference the image using either the post slug or explicitly writing it. I’ll try to use the slug, like Matt. This is going to take a while.</p>\n<p>Actually, I’m going to leave that alone for now. I just realized Matt’s site uses Jekyll, and I’m not sure how integrated that is (Edit: No, his old site used it). I’ll just take styling points from there for now rather than site structure.</p>\n<p>I reran the wordpress-export-to-markdown script to get rid of the date prefixes on each folder. I’ll also use the <code>.svx</code> extension rather than <code>.md</code>. I tried copy/pasting the contents of one of my .md into an existing .svx post and it seems to work. I’ll need to sort out links to assets though; maybe I can do a regex replace on the whole project.</p>\n<p>I tried doing dynamic routing with <code>[slug]</code> again but it didn’t work. I think the error using <code>dev</code> with Matt’s site might be related, so unless I get that working it probably doesn’t make sense to use that as a guide for implementing it in Elianiva’s site.</p>\n<p>Using Windows shell, I ran</p>\n<div class=\"code-block svelte-1w2kx1p\">\n\t<div class=\"lang svelte-1w2kx1p\">shell</div>\n\t<pre class=\"language-shell\"><!-- HTML_TAG_START --><code class=\"language-shell\"><span class=\"token keyword\">for</span> /R %x <span class=\"token keyword\">in</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\"></span>*.md<span class=\"token punctuation\">)</span> <span class=\"token keyword\">do</span> ren <span class=\"token string\">\"%x\"</span> <span class=\"token punctuation\"></span>*.svx</code><!-- HTML_TAG_END --></pre>\n</div>\n<p>to rename all the markdown files.</p>\n<p>I also noticed each post needs to have tags. It’s probably worth adding them.</p>\n<p>I was able to to a regex replace by folder.</p>\n<p>I need to restructure the images - I’m doing it by hand. I’ll also need to change the links to wordpress assets accordingly. Probably by hand again. I have 62 posts, so it’s not too bad; they don’t all have pictures either.</p>\n<p>Okay, did a bunch of moving/renaming/deleting files and links in posts. Not done yet, but it builds. <a href=\"https://blog.ihtfy.com/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">Here</a> for now.</p>\n<p>I’m not sure why, but adding smooth scroll breaks navigation. Maybe something with lazy loading components? Or more likely the fading transition.</p>","css":{"code":".code-block.svelte-1w2kx1p.svelte-1w2kx1p{display:block;position:relative;background-color:var(--code-background-color);color:var(--code-text-color);font-family:var(--mono-font);font-size:1rem;line-height:1.33em;border-radius:8px;box-shadow:var(--shadow);padding:30px 15px;margin:30px 0}.code-block.svelte-1w2kx1p pre{overflow-x:auto;scrollbar-color:var(--primary-color) var(--scrollbar-track-color);scrollbar-width:thin;padding-bottom:5px}.code-block.svelte-1w2kx1p pre::-webkit-scrollbar{height:8px}.code-block.svelte-1w2kx1p pre::-webkit-scrollbar-thumb{background:var(--primary-color)}.code-block.svelte-1w2kx1p pre::-webkit-scrollbar-thumb:hover{background:var(--primary-light-color)}.code-block.svelte-1w2kx1p .lang.svelte-1w2kx1p{position:absolute;right:0;top:-15px;background:inherit;border-radius:8px;padding:5px 10px;z-index:2;font-size:0.85em}.code-block.svelte-1w2kx1p .filename.svelte-1w2kx1p{background:inherit;border-top-left-radius:8px;border-top-right-radius:8px;margin-bottom:-2px;padding:5px 10px;position:absolute;left:0px;top:-15px;z-index:1}","map":null},"head":"","readingTime":"3 min read"},{"slug":"migrating","title":"migrating","date":"2022-02-20T00:00:00.000Z","excerpt":"Moving my site to GitHub","tags":["code","design","website"],"html":"<p>I’m going to try migrating this site from WordPress to a SvelteKit site hosted on GitHub. I’m paying $99 per year to host on wordpress.com; there’s a cheaper plan now, but I don’t see any way to downgrade - only upgrade. It’s also very limiting: I can’t add an SVG image, custom JS (expected), but even the additional CSS rules are very limited because the theme overrides them.</p>\n<p>My hope is to export this site data. Find a way to “load” it into a SvelteKit site, then I’ll go through all the posts by hand and make sure everything is working correctly. I used to host a Jekyll blog site on gh pages, but it kept breaking because GitHub would update dependencies automatically.</p>\n<p>One nice thing about WordPress is I can easily write from my phone and schedule posts. I’m actually starting this post on February 17th, but I’ll post it on the 19th.</p>\n<p>There are some limitations on GitHub pages. They need to be static which is fine with me, but I’ll likely need to do some tweaking and use a different theme. The storage and bandwidth limitations on GitHub aren’t a concern to me since I don’t get much traffic to my site, and I plan on hosting most videos on YouTube.</p>\n<h2 id=\"exporting\">Exporting<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#exporting\"><span class=\"heading-link\">#</span></a></h2>\n<p>I went to <code>https://wordpress.com/export/frankiemercado.com</code> to export all my website content. This gave me a big XML file with all my posts. The images are nested inside of month and year folders, so one file may be at <code>./2022/01/image.jpg</code>.</p>\n<p>The formatting of the XML is pretty cluttered; lots of “wp” comments and “wp:…” tags which is to be expected. I think I’d like my site to have each post structured as markdown. When I searched for “wordpress to markdown” I find <a href=\"https://github.com/lonekorean/wordpress-export-to-markdown\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">this script</a>.</p>\n<p>From Windows PowerShell, I go to the folder containing all my data.</p>\n<p><code>cd .\\\\Downloads\\\\wp20220218</code></p>\n<p>Then I run the command:</p>\n<div class=\"code-block svelte-1w2kx1p\">\n\t<div class=\"lang svelte-1w2kx1p\">shell</div>\n\t<pre class=\"language-shell\"><!-- HTML_TAG_START --><code class=\"language-shell\">npx wordpress-export-to-markdown</code><!-- HTML_TAG_END --></pre>\n</div>\n<p>I renamed the XML file to <code>export.xml</code>, and kept the default output folder name. These are the settings I used:</p>\n<div class=\"code-block svelte-1w2kx1p\"><div class=\"filename svelte-1w2kx1p\">config</div>\n\t<div class=\"lang svelte-1w2kx1p\">shell</div>\n\t<pre class=\"language-shell\"><!-- HTML_TAG_START --><code class=\"language-shell\">Starting wizard…  \n? Path to WordPress <span class=\"token builtin class-name\">export</span> file? export.xml  \n? Path to output folder? output  \n? Create year folders? No  \n? Create month folders? No  \n? Create a folder <span class=\"token keyword\">for</span> each post? Yes  \n? Prefix post folders/files with date? Yes  \n? Save images attached to posts? Yes  \n? Save images scraped from post body content? Yes  \n? Include custom post types and pages? No</code><!-- HTML_TAG_END --></pre>\n</div>\n<p>Now I have a folder called <code>output</code> filled with folders for each post named like: YYYY-MM-DD-PostTitle. Inside one of these folders is an <code>index.md</code> file which contains the text and formatting of the post. There is also a folder called <code>images</code> which contains any images from that post.</p>\n<h2 id=\"new-theme\">New Theme<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#new-theme\"><span class=\"heading-link\">#</span></a></h2>\n<p>Next, I need to find a new theme to use.</p>\n<ul><li><a href=\"https://fantinel.dev/blog-development-sveltekit/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">This one</a> looks nice, but has some server side code I’d need to work around if I host for free on GitHub</li>\n<li><a href=\"https://github.com/svelteland/svelte-kit-blog-demo\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">This one</a> is simple and static.</li></ul>\n<p>After looking at the first one again, it looks like he’s <a href=\"https://github.com/matfantinel/matfantinel.github.io/deployments/activity_log?environment=github-pages\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">hosted on github-pages</a> too, so I think I’ll start there.</p>\n<h2 id=\"setup\">Setup<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#setup\"><span class=\"heading-link\">#</span></a></h2>\n<p>I downloaded the .zip file from <a href=\"https://github.com/matfantinel/matfantinel.github.io\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">his GitHub</a>, extract it, and open in VS Code. Looking at <code>package.json</code> I see the usual SvelteKit scripts: <code>dev</code>, <code>build</code>, <code>preview</code>. He also has a <code>deploy</code> script for <code>gh-pages</code> to publish the <code>build</code> folder, and some <code>prettier</code> stuff for linting and formatting.</p>\n<p>I’ll run <code>npm install</code> and see what happens. No errors.</p>\n<p>I think I’ll need to change the <code>build</code> script though, since I’m on Windows, and I don’t think it will recognize the <code>rm -rf ...</code> command, though PowerShell does use some Unix commands, so who knows.</p>\n<p>Let’s try <code>npm run dev</code>. Errors: <code>config.kit.target is no longer required, and should be removed</code>.</p>\n<p>In <code>svelte.config.js</code> I’ll remove the <code>target</code> from <code>kit: {...</code>.</p>\n<p>Now when I run, there are no errors in the console, but the page (<code>localhost:3000</code>) has an error: <code>Unrecognized option &#39;enableSourcemap&#39;</code>.</p>\n<p>After searching a bit, I may need to update svelte or some other decency. I’ll run <code>npm update</code>. That seemed to fix it.</p>\n<p>I see the site, but when I scroll down and up, it crashes and gives another error: <code>[plugin:vite-plugin-svelte] Error while preprocessing C:/Users/Frankie/Documents/Code/blog/src/lib/posts/web-workers.md - Cannot read property &#39;buildPlaceholders&#39; of undefined</code>.</p>\n<p>I run <code>npm install</code> again to see if that fixes anything. Nope.</p>\n<p>I’m able to open the <code>resume</code> page fine, but all of the blog posts are broken because of the issue.</p>\n<p>I wonder if I need to run the <code>postbuild</code> script to run <code>svelte-sitemap</code>, just guessing. I’ll need to make the <code>build</code> script Windows PowerShell friendly first.</p>\n<p>I added a file called <code>.nojekyll</code> to the <code>/static</code> directory. Then the <code>build</code> script just becomes <code>svelte-kit build</code>.</p>\n<p>I’m also going to remove the Plausible analytics. I’ll just comment out the scripts in the head of <code>app.html</code>.</p>\n<p>Still not working. I see someone posted <a href=\"https://github.com/matfantinel/matfantinel.github.io/issues/18\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">the same issue</a>. I was able to fix the latter issue that’s linked, but I haven’t been able to fix the mdsvex/prismjs problem.</p>","css":{"code":".code-block.svelte-1w2kx1p.svelte-1w2kx1p{display:block;position:relative;background-color:var(--code-background-color);color:var(--code-text-color);font-family:var(--mono-font);font-size:1rem;line-height:1.33em;border-radius:8px;box-shadow:var(--shadow);padding:30px 15px;margin:30px 0}.code-block.svelte-1w2kx1p pre{overflow-x:auto;scrollbar-color:var(--primary-color) var(--scrollbar-track-color);scrollbar-width:thin;padding-bottom:5px}.code-block.svelte-1w2kx1p pre::-webkit-scrollbar{height:8px}.code-block.svelte-1w2kx1p pre::-webkit-scrollbar-thumb{background:var(--primary-color)}.code-block.svelte-1w2kx1p pre::-webkit-scrollbar-thumb:hover{background:var(--primary-light-color)}.code-block.svelte-1w2kx1p .lang.svelte-1w2kx1p{position:absolute;right:0;top:-15px;background:inherit;border-radius:8px;padding:5px 10px;z-index:2;font-size:0.85em}.code-block.svelte-1w2kx1p .filename.svelte-1w2kx1p{background:inherit;border-top-left-radius:8px;border-top-right-radius:8px;margin-bottom:-2px;padding:5px 10px;position:absolute;left:0px;top:-15px;z-index:1}","map":null},"head":"","readingTime":"5 min read"}]}