{"slug":"shortlist","title":"shortlist","date":"2022-02-27","excerpt":"TODO","tags":["todo"],"html":"<p>My new website is getting close to being live. I’ve transferred all my posts and made quite a few changes. The main things remaining are:</p>\n<ul><li>Replace with my Projects</li>\n<li>Reduce the file size of cover images (smaller resolution and use webp or avif)</li>\n<li>Add SVG animations</li></ul>\n<p>There are also 2 bugs I need to look into:</p>\n<ul><li>If you show more posts, then use the back button to navigate, it will still show all posts on the main page. I think this is because the number of posts shown on the homepage is just limited by the api call rather than the svelte component <code>each</code> block</li>\n<li>Avoid the default GitHub 404 page. There is a custom 404 which works on dev, but the deployed site doesn’t behave the same way.</li></ul>\n<p>Matt fixed the <a href=\"https://github.com/matfantinel/matfantinel.github.io/issues/18\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">dev error</a>. Apparently, he had left some old code in a post which was using a library from when his site used Jekyll. I think I can use his site as a guide to restructure mine to use dynamic routing for the posts; and then hopefully I can bundle each post into a folder with a markdown file, cover image, and other images. It looks silly to have to duplicate the file structure and reference images with full explicit paths.</p>","css":{"code":"","map":null},"head":"","readingTime":"2 min read","relatedPosts":[{"slug":"habit","title":"habit","date":"2022-04-02","excerpt":"TODO","tags":["todo"],"html":"<p>I still get reminders from the WordPress app to post everyday. Some days it doesn’t work though.</p>\n<p>I started working on building my website with sveltekit again. It’s at <a href=\"https://site.ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">site.ihtfy.com</a> for now, but eventually I’ll put it on <a href=\"https://ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">ihtfy.com</a> and <a href=\"https://frankiemercado.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">frankiemercado.com</a> will forward to <a href=\"https://ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">ihtfy.com</a> I think.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"again","title":"again","date":"2022-03-31","excerpt":"TODO","tags":["todo"],"html":"<p>I forgot to write again.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"wombo","title":"wombo","date":"2022-03-31","excerpt":"TODO","tags":["todo"],"html":"<p>I’ve been using <a href=\"https://app.wombo.art/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">this site</a> to make the thumbnail images for these posts - using the title as the prompt.</p>\n<p>The last two days, I forgot to write until just after midnight. I adjusted the post date to be 11:59pm just to keep the dates consistent, but I failed to adhere to the original goal. I think I will move to the weekly posts, and just update the draft throughout the week. This should mean there are no more totally junk posts like the last two days.</p>\n<p>Once I migrate to my new site - by June 21, 2022 - I may consolidate these last 3 months of daily posts.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"}]}