{"slug":"similar","title":"similar","date":"2022-03-14","excerpt":"TODO","tags":["todo"],"html":"<p>There are some words between which I always forget the difference.</p>\n<h2 id=\"genuine-vs-authentic\">Genuine vs Authentic<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#genuine-vs-authentic\"><span class=\"heading-link\">#</span></a></h2>\n<p>They’re considered synonymous and interchangeable in causal language. What bothered me is that the definitions are often circular and imply a distinction, but it’s inconsistent between sources.</p>\n<p>They both mean “real”. “Genuine” merely implies it’s not artificial or synthetic. “Authentic” implies it is proper and real in the strictest sense. Genuine leather would mean it’s not vinyl but hide. Authentic Italian leather would mean it is genuine leather material and sourced in Italy or something like that.</p>\n<p>More importantly, non-genuine would be something totally fake, while inauthentic could still be of the same kind but just not fully real in some way.</p>\n<h2 id=\"amiable-vs-amenable--vs-amicable\">Amiable vs Amenable ( vs Amicable)<a aria-hidden=\"true\" tabindex=\"-1\" href=\"#amiable-vs-amenable--vs-amicable\"><span class=\"heading-link\">#</span></a></h2>\n<p>They all kind of mean “able to get along”. “Amicable” is used when referring to a relationship or multiple people, so I usually don’t get that one messed up. “Ambiable” describes a person as generally friendly. “Amenable” describes a person’s feelings toward something else.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read","relatedPosts":[{"slug":"habit","title":"habit","date":"2022-04-02","excerpt":"TODO","tags":["todo"],"html":"<p>I still get reminders from the WordPress app to post everyday. Some days it doesn’t work though.</p>\n<p>I started working on building my website with sveltekit again. It’s at <a href=\"https://site.ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">site.ihtfy.com</a> for now, but eventually I’ll put it on <a href=\"https://ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">ihtfy.com</a> and <a href=\"https://frankiemercado.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">frankiemercado.com</a> will forward to <a href=\"https://ihtfy.com\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">ihtfy.com</a> I think.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"again","title":"again","date":"2022-03-31","excerpt":"TODO","tags":["todo"],"html":"<p>I forgot to write again.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"wombo","title":"wombo","date":"2022-03-31","excerpt":"TODO","tags":["todo"],"html":"<p>I’ve been using <a href=\"https://app.wombo.art/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">this site</a> to make the thumbnail images for these posts - using the title as the prompt.</p>\n<p>The last two days, I forgot to write until just after midnight. I adjusted the post date to be 11:59pm just to keep the dates consistent, but I failed to adhere to the original goal. I think I will move to the weekly posts, and just update the draft throughout the week. This should mean there are no more totally junk posts like the last two days.</p>\n<p>Once I migrate to my new site - by June 21, 2022 - I may consolidate these last 3 months of daily posts.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"}]}