{"slug":"wombo","title":"Wombo","date":"2022-03-31T00:00:00.000Z","excerpt":"How I made the thumbnails for these posts.","tags":["art","website"],"html":"<p>I’ve been using <a href=\"https://app.wombo.art/\" rel=\"nofollow noopener noreferrer\" target=\"_blank\">this site</a> to make the thumbnail images for these posts - using the title as the prompt.</p>\n<p>The last two days, I forgot to write until just after midnight. I adjusted the post date to be 11:59pm just to keep the dates consistent, but I failed to adhere to the original goal. I think I will move to the weekly posts, and just update the draft throughout the week. This should mean there are no more totally junk posts like the last two days.</p>\n<p>Once I migrate to my new site - by June 21, 2022 - I may consolidate these last 3 months of daily posts.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read","relatedPosts":[{"slug":"scss","title":"SCSS","date":"2022-04-04T00:00:00.000Z","excerpt":"I've been changing the color palette for the new site.","tags":["website"],"html":"<p>I’ve been changing the color palette of the themes. Kind of made a mess, but got it sorted out. I wasn’t very familiar with how sass uses rgb variables and the <code>rgb()</code> and <code>rgba()</code> functions. There doesn’t seem to be a clean way to modify the alpha of a variable color.</p>\n<p>Some docs said you can just use the rgb color as the 1st argument and the alpha as the second in a <code>rgba()</code> but that doesn’t work, unless you simply have the 3 values as the variable, not the actual color. But then you need to convert those numbers anywhere else you need to use the color. So you either need multiple variables, or you’re using <code>rgb()</code> and <code>rgba()</code> at every instance.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"manual","title":"Manual","date":"2022-04-03T00:00:00.000Z","excerpt":"Still converting","tags":["website"],"html":"<p>I’ve been converting my old posts to work with the new site. Slow going, but making progress.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"},{"slug":"catchup","title":"Catchup","date":"2022-04-02T00:00:00.000Z","excerpt":"I was working on formatting all my posts again to work with the new site.","tags":["website"],"html":"<p>I was working on formatting all my posts again to work with the new site. It’s taking a while.</p>\n<p>The error messages aren’t very specific; I just know it’s failing when processing all my posts.</p>\n<p>I keep finding changes I need to make, but not all of them yet.</p>","css":{"code":"","map":null},"head":"","readingTime":"1 min read"}]}